Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Look for pink-highlighted buttons or badges - these indicate actions powered by the Dev Assistant.
ja_jp: ピンク色でハイライトされたボタンやバッジを探してください。これらは Dev Assistant によるアクションであることを示しています。

source: Looking Ahead
ja_jp: 将来を見据えて

source: Looking Forward
ja_jp: 今後の展望

source: Looking at Auth0 tokens in the OIDC Dev UI
ja_jp: OIDC Dev UI で Auth0 トークンを確認する

source: Looking at the data produced by this counter, you can tell how often a negative number was checked, or the number one, or an even number, and so on. Try the following sequence and look for `example_prime_number_total` in the plain text output. Note that the `_total` suffix is added when Micrometer applies Prometheus naming conventions to `example.prime.number`, the originally specified counter name.
ja_jp: このカウンタが出力するデータを見ると、負の数、1の数、偶数の数などがどれくらいの頻度でチェックされたかがわかります。次のシーケンスを試して、プレーンテキストの出力で `example_prime_number_total` を探してみてください。なお、 `_total` サフィックスは、元々指定されていたカウンタ名 `example.prime.number` に Micrometer が Prometheus の命名規則を適用したときに付けられたものです。

source: Looking at the dimensional data produced by this counter, you can count:
ja_jp: このカウンターによって生成されたディメンションデータで、以下を数えることができます:

source: Looking at the dimensional data produced by this counter, you can use the sum and the count to calculate how long (on average) it takes to determine if a number is prime. Using the dimensional label, you might be able to understand if there is a significant difference in duration for numbers that are prime when compared with numbers that are not.
ja_jp: このカウンターによって生成されたディメンションデータを見ると、合計とカウントを使用して、数値が素数であるかどうかを判断するのにかかる (平均) 時間を計算できます。ディメンションラベルを使用すると、素数とそれ以外の数の期間に大きな違いがあるかどうかを理解できます。

source: Looking forward
ja_jp: 前を向いて

source: Looks good! Congratulations you just finished your first extension.
ja_jp: 問題なさそうですね。初めてのエクステンションの作成、おつかれさまでした。

source: Looks good. What is the bean scope?
ja_jp: 良いですね。Beanスコープとは何ですか?

source: Looks like it works out of the box?!?
ja_jp: 修正不要にみえる?!?

source: Loop Section
ja_jp: ループセクション

source: Lots of improvements for the Quarkus CLI, that has now been published to Homebrew, SDMAN!...
ja_jp: Quarkus CLIには多くの改良が加えられ、Homebrew、SDMANに公開されました！...

source: Lowering the administrative burden of deploying distributed inter-related services by creating a logical deployment abstraction on top of these services; something like the https://helm.sh/docs/howto/charts_tips_and_tricks/#complex-charts-with-many-dependencies[umbrella chart] pattern.
ja_jp: link:https://helm.sh/docs/howto/charts_tips_and_tricks/#complex-charts-with-many-dependencies[アンブレラチャートパターン]のように、サービスの上に論理的な展開の抽象化を行うことで、相互に関連する分散型サービスを展開する際の管理負担を軽減する。

source: Luna Streaming is a production-ready distribution of Apache Pulsar, with tools and support from DataStax. After creating your DataStax Luna Pulsar tenant, note the auto generated token, and configure the token authentication:
ja_jp: Luna Streaming は、DataStax のツールとサポートを備えた、Apache Pulsar の製品版ディストリビューションです。 DataStax Luna Pulsar テナントを作成したら、自動生成されたトークンをメモし、トークン認証を設定します。

source: M -> https://grafana.com/oss/mimir[Mimir] (long term storage for Prometheus)
ja_jp: M -> https://grafana.com/oss/mimir[Mimir] (Prometheus の長期保存)

source: MCP Resources against a recorded value
ja_jp: 記録された値に対する MCP リソース

source: MCP Resources against build time data
ja_jp: ビルド時データに対する MCP リソース

source: MCP Tools against the Deployment classpath
ja_jp: デプロイメントクラスパスに対する MCP ツール

source: MCP Tools against the Runtime classpath
ja_jp: ランタイムクラスパスに対する MCP ツール

source: MCP resources
ja_jp: MCP リソース

source: MCP tools
ja_jp: MCP ツール

source: MDC and supported logging APIs
ja_jp: MDCとサポートされるロギングAPI

source: MDC propagation
ja_jp: MDCの伝播

source: MQTT Client
ja_jp: MQTTクライアント

source: MQTT reactive messaging connector
ja_jp: MQTT リアクティブメッセージングコネクター

source: MS SQL Client
ja_jp: MS SQLクライアント

source: MTA 5.1.2 and beyond
ja_jp: MTA 5.1.2以降

source: MTLS token binding
ja_jp: MTLS トークンバインディング

source: MTLS token binding supports a `holder of key` concept, and can be used to confirm that the current access token was issued to the current authenticated client who presents this token.
ja_jp: MTLS トークンバインディングは `キーの所有者` の概念をサポートしており、現在のアクセストークンがこのトークンを提示する現在の認証済みクライアントに発行されたことを確認するために使用できます。

source: Mac osx/x86 64bits
ja_jp: Mac osx/x86 64 ビット

source: Mail Client
ja_jp: メールクライアント

source: Mailer - which offer the possibility to send emails
ja_jp: Mailer - 電子メールの送信を可能にします。

source: Mailer Configuration Reference
ja_jp: Mailer設定リファレンス

source: Mailer Reference Guide
ja_jp: Mailerリファレンスガイド

source: Mailer configuration for popular email services
ja_jp: 一般的なメールサービスに対応したMailer設定

source: Mailer extension
ja_jp: Mailerエクステンション

source: Mailer so that we can send emails
ja_jp: 電子メールを送信するためのMailer

source: Mailing list index page.
ja_jp: メーリングリストのインデックスページです。

source: Main Configuration
ja_jp: 主な構成

source: Main Drawback
ja_jp: 主な欠点

source: Main Use cases
ja_jp: 主なユースケース

source: Main Use-Cases
ja_jp: 主なユースケース

source: Main changes
ja_jp: 主な変更点

source: Maintainer
ja_jp: メンテナー

source: Major Changes
ja_jp: 主な変更点

source: Major version is extracted from the last existing migration in your project.
ja_jp: メジャーバージョンは、プロジェクト内に存在する最後のマイグレーションから抽出されます。

source: Make a `src/main/resources/import.sql` file in your project
ja_jp: プロジェクトに `src/main/resources/import.sql` ファイルを作成します。

source: Make all classes annotated with `@Startup` unremovable.
ja_jp: `@Startup` でアノテーションされたすべてのクラスを削除できないようにする。

source: Make and open a flamegraph:
ja_jp: フレームグラフを作成して開いてください。

source: Make it extend `PanacheEntity`
ja_jp: `PanacheEntity` を継承させる

source: Make its fields `public`
ja_jp: フィールドを `public` にする

source: Make my extension extend the Dev UI
ja_jp: エクステンションで Dev UI を拡張する

source: Make sure Quarkus is still running in another terminal.
ja_jp: 別のターミナルでQuarkusがまだ起動していることを確認します。

source: Make sure also to enable the SSL channel security protocol using the `security.protocol` property configured to `SSL` or `SASL_SSL`.
ja_jp: また、 `security.protocol` プロパティーを `SSL` または `SASL_SSL` に設定して、SSL チャネルセキュリティープロトコルを必ず有効にしてください。

source: Make sure any integration tests you execute with Gradle are located within `src/integrationTest/java`. Integration tests that exist in `src/test` will run with normal build and fail.
ja_jp: Gradle で実行する統合テストが `src/integrationTest/java` 内にあることを確認してください。 `src/test` に存在する統合テストは通常のビルドで実行され、失敗します。

source: Make sure any integration tests you execute with Maven use the `*IT.java` file pattern so that regular builds do not execute the test.
ja_jp: Maven で実行する統合テストが `*IT.java` ファイルパターンを使用していることを確認してください。そうすれば、通常のビルドでテストが実行されることはありません。

source: Make sure any integration tests you execute with maven use the `*IT.java` file pattern so that regular builds do not execute the test.
ja_jp: maven で実行する統合テストが `*IT.java` ファイルパターンを使用しているようにし、通常のビルドでテストが実行されないようにします。

source: Make sure consumer subscription starts receiving messages from the `Earliest` position.
ja_jp: コンシューマーのサブスクリプションが `Earliest` 位置からメッセージの受信を開始することを確認します。

source: Make sure that the coordinator is still running otherwise you will see an error message similar to the following:
ja_jp: コーディネーターが動作していることを確認してください。そうでない場合は、以下のようなエラーメッセージが表示されます。

source: Make sure that the setting `quarkus.cassandra.local-datacenter` matches the datacenter of your Cassandra cluster.
ja_jp: 設定 `quarkus.cassandra.local-datacenter` が、Cassandraクラスターのデータセンターと一致していることを確認してください。

source: Make sure that you use OpenJDK and JVM versions supporting virtual thread and launch the _dev mode_ with `./mvnw quarkus:dev`:
ja_jp: 仮想スレッドをサポートするOpenJDKとJVMのバージョンを使用し、 `./mvnw quarkus:dev` で _devモード_ を起動しているようにして下さい：

source: Make sure that your URL starts with `rediss://` (with two `s`)
ja_jp: URLが `rediss://` (2つの `s`) で始まるようにします。

source: Make sure the Quarkus-specific `@io.quarkus.hibernate.orm.JsonFormat` annotation is used and not the one from Jackson.
ja_jp: Jackson のアノテーシではなく、 Quarkus 固有の `@io.quarkus.hibernate.orm.JsonFormat` アノテーションが使用されていることを確認します。

source: Make sure the `/logout` path is protected.
ja_jp: `/logout` パスが保護されているようにして下さい。

source: Make sure the `org.jboss.logmanager.LogManager` is used.
ja_jp: `org.jboss.logmanager.LogManager` が使用されていることを確認してください。

source: Make sure the data are set correctly.
ja_jp: データが正しく設定されているようにします。

source: Make sure the method has enough arguments before accessing them from their index. Otherwise, an `IndexOutOfBoundsException` may be thrown during the cache key computation.
ja_jp: インデックスからアクセスする前に、このメソッドが十分な引数を持っていることを確認してください。そうでないと、キャッシュキーの計算中に `IndexOutOfBoundsException` が投げられるかもしれません。

source: Make sure the test method is run on the Vert.x event loop.
ja_jp: テストメソッドがVert.xのイベントループで実行されるようにします。

source: Make sure this redirect filter is called only during a redirect to the session-expired page.
ja_jp: このリダイレクトフィルターは、セッション期限切れページへのリダイレクト中にのみ呼び出されるようにしてください。

source: Make sure this redirect filter is only called during a redirect to the session expired page.
ja_jp: このリダイレクトフィルターは、セッション期限切れページへのリダイレクト中にのみ呼び出されるようにしてください。

source: Make sure to create topics beforehand, or enable the _Auto Topic Creation_ in the namespace configuration.
ja_jp: 必ず事前にトピックを作成するか、namespace 設定で _自動トピック作成_ を有効にしてください。

source: Make sure to fill in the appropriate details, but more importantly the Authorization Callback URL, set to `http://localhost:8080/_renarde/security/github-success` (if you intend to test this using the Quarkus DEV mode).
ja_jp: 詳細を適切に入力する必要がありますが、さらに重要なのは、Authorization Callback URL を `http://localhost:8080/_renarde/security/github-success` に設定することです (Quarkus DEV モードを使用してテストする場合)。

source: Make sure to fill in the appropriate details, but more importantly the Authorization Callback URL, set to `http://localhost:8080/github` (if you intend to test this using the Quarkus dev mode).
ja_jp: 詳細を適切に入力する必要がありますが、さらに Authorization Callback URL を `http://localhost:8080/github` に設定することが重要です (Quarkus dev モードを使用してテストする場合)。

source: Make sure to have `GRAALVM_HOME` configured and pointing to GraalVM version {graalvm-version} (Make sure to use a Java 11 version of GraalVM).
ja_jp: `GRAALVM_HOME` を設定し、GraalVM バージョン {graalvm-version} を指していることを確認してください。(必ずGraalVMのJava 11バージョンを使用してください)。

source: Make sure to have `GRAALVM_HOME` configured and pointing to GraalVM version {graalvm-version} (Make sure to use a Java 11 version of GraalVM). Verify that your `pom.xml` has the proper `native` profile (see <<build-tool-maven>>).
ja_jp: `GRAALVM_HOME` を設定し、GraalVM バージョン {graalvm-version} を指していることを確認してください。(GraalVMのJava 11バージョンを使用していることを確認してください)。あなたの `pom.xml` が適切な `native` プロファイルを持っていることを確認してください( link:#build-tool-maven[[build-tool-maven]] を参照してください)。

source: Make sure to have `GRAALVM_HOME` configured and pointing to the latest release of GraalVM version {graalvm-version} (Make sure to use a Java 11 version of GraalVM).
ja_jp: `GRAALVM_HOME` を設定し、最新リリースのGraalVM バージョン {graalvm-version} を指していることを確認してください。(必ずGraalVMのJava 11バージョンを使用してください)。

source: Make sure to have `GRAALVM_HOME` configured and pointing to the latest release of GraalVM version {graalvm-version}.
ja_jp: `GRAALVM_HOME` がGraalVMのバージョン{graalvm-version}の最新リリースを指すように設定されているようにして下さい。

source: Make sure to have `GRAALVM_HOME` configured and pointing to the latest release of GraalVM version {graalvm-version}. Verify that your `pom.xml` has the proper `native` profile (see <<build-tool-maven>>).
ja_jp: `GRAALVM_HOME` が設定されていて、最新のGraalVM バージョン {graalvm-version} を指しているようにして下さい 。 `pom.xml` に適切な `native` プロファイルがあるようにしてください (<<build-tool-maven>>参照)。

source: Make sure to have `GRAALVM_HOME` configured and pointing to the latest release of GraalVM version {graalvm-version}. Verify that your `pom.xml` has the proper `native` profile as shown in xref:build-tool-maven[Maven configuration].
ja_jp: `GRAALVM_HOME` が設定され、GraalVM バージョン {graalvm-version} の最新リリースを指しているようにして下さい。 xref:build-tool-maven[Mavenの設定] に示されているように、あなたの `pom.xml` が適切な `native` プロファイルを持っているようにして下さい。

source: Make sure to have `GRAALVM_HOME` configured and pointing to the latest release of GraalVM {graalvm-version}.
ja_jp: `GRAALVM_HOME` が設定され、GraalVM の最新リリース ({graalvm-version}) を指していることを確認してください。

source: Make sure to have `GRAALVM_HOME` configured and pointing to the latest release of GraalVM {graalvm-version}. Verify that your `pom.xml` has the proper `native` profile as shown in <<build-tool-maven>>.
ja_jp: `GRAALVM_HOME` が設定され、GraalVM {graalvm-version}の最新リリースを指しているようにして下さい。 <<build-tool-maven>> に示されているように、あなたの `pom.xml` が適切な `native` プロファイルを持っているようにして下さい。

source: Make sure to keep an instance of the observer to cancel later if needed.
ja_jp: 必要に応じて後でキャンセルできるように、オブザーバーのインスタンスを保管してください。

source: Make sure to note the _Registry URL_ of the instance created. For authentication, you can use the same _ServiceAccount_ you created previously. You need to make sure that it has the necessary permissions to access the service registry.
ja_jp: 作成されたインスタンスの _Registry URL_ を書き留めてください。認証には、以前に作成したものと同じ _ServiceAccount_ を使用できます。サービスレジストリーにアクセスするために必要なパーミッションがあることを確認する必要があります。

source: Make sure to replace `yourAccountName` with your docker or quay account name when you run `docker build`. The Dockerfile is a standard Quarkus dockerfile. No special Knative magic.
ja_jp: `docker build` を実行する際には、必ず `yourAccountName` を docker または quay のアカウント名に置き換えてください。Dockerfileは標準のQuarkusのdockerfileです。特別なKnativeマジックはありません。

source: Make sure to use the generated token as the HTTP Authorization Bearer scheme value.
ja_jp: 生成されたトークンを HTTP 認可 Bearer スキームの値として必ず使用してください。

source: Make sure to use the reactive variant
ja_jp: 必ずリアクティブバリアントを使用してください

source: Make sure to wrap methods modifying your database (e.g. `entity.persist()`) within a transaction. Marking a CDI bean method `@ReactiveTransactional` will do that for you and make that method a transaction boundary. Alternatively, you can use `Panache.withTransaction()` for the same effect. We recommend doing so at your application entry point boundaries like your REST endpoint controllers.
ja_jp: データベースを変更するメソッド (例: `entity.persist()` ) は必ずトランザクション内で行うようにしてください。CDI Beanの機能 `@ReactiveTransactional` アノテーションを使うことでそのメソッドをトランザクションの境界にすることができます。あるいは、 `Panache.withTransaction()` を使用しても同様の効果が得られます。REST エンドポイントコントローラーのように、アプリケーションのエントリーポイントの境界でこれを行うことをお勧めします。

source: Make sure to wrap methods modifying your database (e.g. `entity.persist()`) within a transaction. Marking a CDI bean method `@Transactional` will do that for you and make that method a transaction boundary. We recommend doing so at your application entry point boundaries like your REST endpoint controllers.
ja_jp: データベースを変更するメソッド (例: `entity.persist()` ) をトランザクション内でラップするようにしてください。CDI Beanメソッド `@Transactional` をマークすることで、それを実現出来、そのメソッドをトランザクションの境界に出来ます。REST エンドポイントコントローラーのように、アプリケーションのエントリーポイントの境界でこれを行うことをお勧めします。

source: Make sure to wrap methods modifying your database (e.g. `session.persist(entity)`) within a transaction.
ja_jp: データベースを変更するメソッド（例： `session.persist(entity)` ）は、必ずトランザクション内にラップしてください。

source: Make sure use the documentation to have your questions answered.
ja_jp: ドキュメントを利用して疑問を解消してください。

source: Make sure you change the image URL to point to the image you built and pushed earlier!
ja_jp: イメージのURLを、先に作成してプッシュしたイメージを指すように変更してください。

source: Make sure you configure your datasource in your `application.properties` (although you don't have to in DEV mode: if you don't, a dev service will be provided for you):
ja_jp: `application.properties` でデータソースを設定してください (ただし、開発モード の場合は必須ではありません。設定しない場合、dev services が提供されます)。

source: Make sure you configure your reactive datasource in your `application.properties` (although you don't have to in DEV mode: if you don't, a dev service will be provided for you):
ja_jp: `application.properties` でリアクティブデータソースを設定してください (ただし、開発モードでは必須ではありません。設定しない場合、dev services が提供されます)。

source: Make sure you first build both applications in JVM mode with:
ja_jp: 最初に、次のコマンドを使用して両方のアプリケーションを JVM モードでビルドします。

source: Make sure you have `generate-code` goal of `quarkus-maven-plugin` enabled in your `pom.xml`. If you wish to generate code from different `proto` files for tests, also add the `generate-code-tests` goal. Please note that no additional task/goal is required for the Gradle plugin.
ja_jp: `pom.xml` で `generate-code` ゴールの `quarkus-maven-plugin` が有効になっていることを確認してください。テスト用に異なる `proto` ファイルからコードを生成したい場合は、 `generate-code-tests` ゴールも追加してください。Gradleプラグインに追加のタスク/ ゴールは必要ないことに注意してください。

source: Make sure you have a JDK installed before installing the Quarkus CLI.
ja_jp: Quarkus CLI をインストールする前に、JDK がインストールされていることを確認してください。

source: Make sure you have a JDK installed before installing the Quarkus CLI. We haven't added an explicit dependency as we wanted to make sure you could use your preferred JDK version.
ja_jp: Quarkus CLI をインストールする前に、JDK がインストールされていることを確認してください。お好みの JDK バージョンを使用できるようにするため、明示的な依存関係は追加していません。

source: Make sure you have a JDK installed before installing the Quarkus CLI. You can install a JDK with `scoop install openjdk17` for Java 17 or `scoop install openjdk11` for Java 11.
ja_jp: Quarkus CLI をインストールする前に、JDK がインストールされていることを確認してください。JDK は、Java 17 の場合は `scoop install openjdk17` を使用して、Java 11 の場合は `scoop install openjdk11` を使用してインストールできます。

source: Make sure you have a JDK installed before installing the Quarkus CLI. You can install a JDK with `scoop install openjdk17` for Java 17 or `scoop install openjdk21` for Java 21.
ja_jp: Quarkus CLIをインストールする前に、JDKがインストールされていることを確認してください。 Java 17の場合、 `scoop install openjdk17` あるいはJava 21の場合、 `scoop install openjdk21` でJDKをインストールできます。

source: Make sure you have https://sdkman.io/jdks[a JDK installed] before installing the Quarkus CLI.
ja_jp: Quarkus CLI をインストールする前に、 https://sdkman.io/jdks[JDK] がインストールされていることを確認してください。

source: Make sure you have installed *Node.js* and *npm* on your system. Refer to the https://nodejs.org/en/download/[official documentation] for more information if required.
ja_jp: お使いのシステムに *Node.js* と *npm* がインストールされていることを確認してください。必要に応じて、 link:https://nodejs.org/en/download/[公式ドキュメント]を参照してください。

source: Make sure you have the `stern` tool installed. See the Knative Tutorial setup for information on that. Run stern to look for logs outputted by our Funqy deployment
ja_jp: `stern` ツールがインストールされていることを確認してください。それについての情報は Knative チュートリアルのセットアップを参照してください。Funqy デプロイメントが出力したログを探すために stern を実行します。

source: Make sure you have the getting-started application at hand, or clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive]. The solution is located in the `getting-started` directory.
ja_jp: 手元に get-started アプリケーションがあることを確認するか、Git リポジトリをクローンします: `git clone {quickstarts-clone-url}` 、もしくは {quickstarts-archive-url}[archive] をダウンロードしてください。ソリューションは `getting-started` ディレクトリーにあります。

source: Make sure you import the reactive variant of `PanacheEntity`.
ja_jp: `PanacheEntity` のリアクティブ版をインポートしてください。

source: Make sure you reference the image you uploaded previously (assumes that a role exists that can be used to run the lambda). Please note that it is not unlikely that for the JVM lambda function, the default memory limit of `128Mb` will not be enough to run the function. In that case, you can increase the memory limit when creating the function by providing the `--memory-size 256` parameter to your `aws lambda create-function` command. You can also adjust the function in the AWS console after you've created it.
ja_jp: アップロードしておいたイメージを参照していることを確認してください (Lambda の実行に使用できるロールが存在することを前提としています)。JVM Lambda 関数の場合、デフォルトのメモリー制限である `128Mb` が関数を実行するのに十分である可能性が高いことに注意してください。その場合は、 `aws lambda create-function` コマンドに `--memory-size 256` パラメーターを指定することで、関数を作成するときにメモリー制限を増やすことができます。関数を作成した後、AWS コンソールで関数を調整することもできます。

source: Make sure you set the `scope` of these sink dependencies to `provided`, otherwise libraries such as Testcontainers will end-up in your app's production libraries:
ja_jp: これらのシンク依存関係の `scope` を `provided` に設定していることを確認します。そうしないと、Testcontainers などのライブラリーがアプリケーションの製品ライブラリーに含まれてしまいます。

source: Make sure you update both the BOM version and the Quarkus Maven Plugin version to 2.0.0.CR2.
ja_jp: BOMのバージョンとQuarkus Maven Pluginのバージョンの両方を2.0.0.CR2にアップデートしてください。

source: Make sure you use a base image supporting virtual threads. Here we use an image providing Java 21. Quarkus picks an image providing Java 21+ automatically if you do not set one.
ja_jp: 仮想スレッドをサポートするベースイメージを使用するようにしてください。ここでは、Java 21 を提供するイメージを使用します。設定しない場合は、Quarkus によって Java 21+ を提供するイメージが自動的に選択されます。

source: Make sure your JDBC driver supports XA. All <<extensions-and-database-drivers-reference,supported JDBC drivers do>>, but <<other-databases,other JDBC drivers>> might not.
ja_jp: JDBC ドライバーが XA をサポートしていることを確認してください。 すべての <<extensions-and-database-drivers-reference,supported JDBC drivers do>> サポート対象の JDBC ドライバーはサポートしていますが、<<other-databases,other JDBC drivers>> 他の JDBC ドライバーはサポートしていない場合があります。

source: Make sure your `application.properties` contains the configuration explained in xref:native[the native compilation section].
ja_jp: `application.properties` に xref:native[ネイティブコンパイルのセクション] で説明した設定が含まれているようにしてください。

source: Make sure your application has the right permissions to write to the socket.
ja_jp: アプリケーションがソケットに書き込むための適切なアクセス許可を持っていることを確認してください。

source: Make sure your class names are unique across all extension codestarts.
ja_jp: クラス名がすべてのエクステンションのCodestartでユニークであることを担保してください。

source: Make sure your database server is configured to enable XA.
ja_jp: データベースサーバーが XA を有効化するように設定されていることを確認します。

source: Make the `Item` object accessible in the template.
ja_jp: テンプレート内で `Item` オブジェクトにアクセスできるようにします。

source: Make the `roles1` permission match only the endpoint annotated with the `@AuthorizationCodeFlow` annotation. Unannotated endpoints must avoid the delay caused by the `applies-to=JAXRS` option.
ja_jp: `roles1` 権限が、 `@AuthorizationCodeFlow` アノテーションが付けられたエンドポイントのみと一致するようにします。 アノテーションが付いていないエンドポイントは、 `applies-to=JAXRS` オプションによって発生する遅延を回避する必要があります。

source: Make the beans unremovable to prevent ArC from removing the beans if they are only programatically consumed
ja_jp: プログラムでしか消費されない場合に、ArCがBeanを取り除かないようにするために、Beanを取り除けないようにする。

source: Make the custom groups extend the `Default` group. This means that whenever these groups are enabled, the `Default` group is also enabled. This is useful if you have constraints that you want validated in both the `Post` and `Put` method: you can simply use the default group on those constraints, like on the `title` property below.
ja_jp: カスタムグループが `Default` グループを拡張するようにします。これは、これらのグループが有効なときはいつでも、 `Default` グループも有効であることを意味します。これは、 `Post` と `Put` の両方のメソッドで検証したい制約がある場合に便利です。以下の `title` プロパティのように、これらの制約に単純にデフォルトグループを使用することができます。

source: Make the dependency non-optional.
ja_jp: 依存関係を非オプションにする。

source: Make the stream available in the schema and as a WebSocket during runtime
ja_jp: 実行時にスキーマ内で、WebSocketとしてストリームを利用できるようにする

source: Make use of <<typesafe_templates,type-safe templates>> or <<typesafe_expressions,type-safe expressions>>
ja_jp: <<typesafe_templates,type-safe templates>> または <<typesafe_expressions,type-safe expressions>> をご利用ください。

source: Make use of xref:typesafe_templates[type-safe templates] or xref:typesafe_expressions[type-safe expressions]
ja_jp: xref:typesafe_templates[タイプセーフテンプレート] や xref:typesafe_expressions[タイプセーフ式] の使用

source: Make your entities extend `PanacheEntity`: it has an ID field that is auto-generated. If you require a custom ID strategy, you can extend `PanacheEntityBase` instead and handle the ID yourself.
ja_jp: エンティティは `PanacheEntity` を拡張するようにしてください: 自動生成されるIDフィールドがあります。カスタムID戦略が必要な場合は代わりに `PanacheEntityBase` を拡張するとIDを自分で処理することができます。

source: Make your entities extend `PanacheMongoEntity` (optional if you are using the repository pattern)
ja_jp: エンティティが `PanacheMongoEntity` を継承するようにする（リポジトリパターンを使用している場合はオプション）。
